andrewechang/cownect/firmware-collar/sdkconfig.defaults
# CowNect collar - ESP32-S3-WROOM-1-N16R8 defaults (ESP-IDF v5.5.5)
CONFIG_IDF_TARGET="esp32s3"

# N16R8: 16 MB quad flash, 8 MB octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Large buffers are placed in PSRAM explicitly with heap_caps_malloc(MALLOC_CAP_SPIRAM)
# (Material 4 section 8). Ordinary malloc() stays in internal RAM.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Native USB-C (USB-Serial-JTAG) is the primary development console (Material 4 section 7).
# UART0 (TXD0/RXD0) remains the backup ROM-download/programming path.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y
